
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 0 to add, 5 to change, 2 to destroy.</code></pre>

* Update
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_schedule.schedule
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_schedule.trigger_once
  * module.automation_runbook_sas_token_renewal[&#34;rota-rlw&#34;].azurerm_automation_schedule.schedule
  * module.automation_runbook_sas_token_renewal[&#34;rota-rlw&#34;].azurerm_automation_schedule.trigger_once
  * module.sa.azurerm_storage_account.storage_account
* Delete
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;vh-client-id&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;vh-client-pwd&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.automation_runbook_sas_token_renewal["rota-rl"].data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_schedule.schedule will be updated in-place
  ~ resource "azurerm_automation_schedule" "schedule" {
        id                      = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/hmi-sharedinfra-sds-prod-rg/providers/Microsoft.Automation/automationAccounts/hmi-prod-aa/schedules/rotate-sas-tokens-hmisaprod-rota-rl-schedule"
        name                    = "rotate-sas-tokens-hmisaprod-rota-rl-schedule"
      ~ start_time              = "2025-05-30T01:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_schedule.trigger_once will be updated in-place
  ~ resource "azurerm_automation_schedule" "trigger_once" {
        id                      = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/hmi-sharedinfra-sds-prod-rg/providers/Microsoft.Automation/automationAccounts/hmi-prod-aa/schedules/rotate-sas-tokens-hmisaprod-rota-rl-schedule-single-trigger"
        name                    = "rotate-sas-tokens-hmisaprod-rota-rl-schedule-single-trigger"
      ~ start_time              = "2025-05-29T09:18:00Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].azurerm_automation_schedule.schedule will be updated in-place
  ~ resource "azurerm_automation_schedule" "schedule" {
        id                      = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/hmi-sharedinfra-sds-prod-rg/providers/Microsoft.Automation/automationAccounts/hmi-prod-aa/schedules/rotate-sas-tokens-hmisaprod-rota-rlw-schedule"
        name                    = "rotate-sas-tokens-hmisaprod-rota-rlw-schedule"
      ~ start_time              = "2025-05-30T01:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].azurerm_automation_schedule.trigger_once will be updated in-place
  ~ resource "azurerm_automation_schedule" "trigger_once" {
        id                      = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/hmi-sharedinfra-sds-prod-rg/providers/Microsoft.Automation/automationAccounts/hmi-prod-aa/schedules/rotate-sas-tokens-hmisaprod-rota-rlw-schedule-single-trigger"
        name                    = "rotate-sas-tokens-hmisaprod-rota-rlw-schedule-single-trigger"
      ~ start_time              = "2025-05-29T09:18:00Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret["vh-client-id"] will be destroyed
  # (because key ["vh-client-id"] is not in for_each map)
  - resource "azurerm_key_vault_secret" "secret" {
      - id                      = "https://hmi-sds-kv-prod.vault.azure.net/secrets/vh-client-id/87865aba86044636b692c6a4ede70643" -> null
      - key_vault_id            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/hmi-sharedinfra-sds-prod-rg/providers/Microsoft.KeyVault/vaults/hmi-sds-kv-prod" -> null
      - name                    = "vh-client-id" -> null
      - resource_id             = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/hmi-sharedinfra-sds-prod-rg/providers/Microsoft.KeyVault/vaults/hmi-sds-kv-prod/secrets/vh-client-id/versions/87865aba86044636b692c6a4ede70643" -> null
      - resource_versionless_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/hmi-sharedinfra-sds-prod-rg/providers/Microsoft.KeyVault/vaults/hmi-sds-kv-prod/secrets/vh-client-id" -> null
      - tags                    = {
          - "application"         = "hearings-management-interface"
          - "builtFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          - "businessArea"        = "Cross-Cutting"
          - "contactSlackChannel" = "#hearing-management-information"
          - "environment"         = "production"
          - "managedBy"           = "Future Hearings - Hearing Management Information"
          - "source"              = "bootstrap hmi-bootstrap-kv-prod secrets"
        } -> null
      - value                   = (sensitive value) -> null
      - value_wo                = (write-only attribute) -> null
      - value_wo_version        = 0 -> null
      - version                 = "87865aba86044636b692c6a4ede70643" -> null
      - versionless_id          = "https://hmi-sds-kv-prod.vault.azure.net/secrets/vh-client-id" -> null
        # (1 unchanged attribute hidden)
    }

  # module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret["vh-client-pwd"] will be destroyed
  # (because key ["vh-client-pwd"] is not in for_each map)
  - resource "azurerm_key_vault_secret" "secret" {
      - id                      = "https://hmi-sds-kv-prod.vault.azure.net/secrets/vh-client-pwd/77f2c997a932430b8f67269a90192f8f" -> null
      - key_vault_id            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/hmi-sharedinfra-sds-prod-rg/providers/Microsoft.KeyVault/vaults/hmi-sds-kv-prod" -> null
      - name                    = "vh-client-pwd" -> null
      - resource_id             = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/hmi-sharedinfra-sds-prod-rg/providers/Microsoft.KeyVault/vaults/hmi-sds-kv-prod/secrets/vh-client-pwd/versions/77f2c997a932430b8f67269a90192f8f" -> null
      - resource_versionless_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/hmi-sharedinfra-sds-prod-rg/providers/Microsoft.KeyVault/vaults/hmi-sds-kv-prod/secrets/vh-client-pwd" -> null
      - tags                    = {
          - "application"         = "hearings-management-interface"
          - "builtFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          - "businessArea"        = "Cross-Cutting"
          - "contactSlackChannel" = "#hearing-management-information"
          - "environment"         = "production"
          - "managedBy"           = "Future Hearings - Hearing Management Information"
          - "source"              = "bootstrap hmi-bootstrap-kv-prod secrets"
        } -> null
      - value                   = (sensitive value) -> null
      - value_wo                = (write-only attribute) -> null
      - value_wo_version        = 0 -> null
      - version                 = "77f2c997a932430b8f67269a90192f8f" -> null
      - versionless_id          = "https://hmi-sds-kv-prod.vault.azure.net/secrets/vh-client-pwd" -> null
        # (1 unchanged attribute hidden)
    }

  # module.sa.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/hmi-sharedinfra-sds-prod-rg/providers/Microsoft.Storage/storageAccounts/hmisaprod"
        name                               = "hmisaprod"
        tags                               = {
            "application"         = "hearings-management-interface"
            "builtFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#hearing-management-information"
            "environment"         = "production"
            "managedBy"           = "Future Hearings - Hearing Management Information"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 5 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":81,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->